Exeter_CFD_Problems/data/HeatExchanger/case_multi/heat_exchange/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       19800;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       19900;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       20000;
    }
    bottomWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       20100;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       20200;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       30200;
    }
)

// ************************************************************************* //
